In [30]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.compose import ColumnTransformer

In [2]:
data = pd.read_csv("Dataset/processed-car-price.csv")

In [3]:
data.head()

,Unnamed: 0,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Brand,Model
0,0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,1.75,maruti,wagon
1,1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,12.50,hyundai,creta
2,2,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,4.50,honda,jazz
3,3,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,6.00,maruti,ertiga
4,4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,17.74,audi,a4

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         6019 non-null   int64
 1   Location           6019 non-null   object
 2   Year               6019 non-null   int64
 3   Kilometers_Driven  6019 non-null   int64
 4   Fuel_Type          6019 non-null   object
 5   Transmission       6019 non-null   object
 6   Owner_Type         6019 non-null   object
 7   Mileage            6019 non-null   float64
 8   Engine             6019 non-null   float64
 9   Power              6019 non-null   float64
 10  Seats              6019 non-null   float64
 11  Price              6019 non-null   float64
 12  Brand              6019 non-null   object
 13  Model              6019 non-null   object
dtypes: float64(5), int64(3), object(6)
memory usage: 658.5+ KB

In [5]:
data.drop(["Unnamed: 0", "Brand"], axis=1, inplace=True)

In [6]:
data.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,1.75,wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,12.50,creta
2,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,4.50,jazz
3,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,6.00,ertiga
4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,17.74,a4

In [7]:
Y = data["Price"]
Y

0        1.75
1       12.50
2        4.50
3        6.00
4       17.74
        ...
6014     4.75
6015     4.00
6016     2.90
6017     2.65
6018     2.50
Name: Price, Length: 6019, dtype: float64

In [10]:
data = data.iloc[:, [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 11]]
data

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,creta
2,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,jazz
3,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,ertiga
4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,a4
...,...,...,...,...,...,...,...,...,...,...,...
6014,Delhi,2014,27365,Diesel,Manual,First,28.40,1248.0,74.00,5.0,swift
6015,Jaipur,2015,100000,Diesel,Manual,First,24.40,1120.0,71.00,5.0,xcent
6016,Jaipur,2012,55000,Diesel,Manual,Second,14.00,2498.0,112.00,8.0,xylo
6017,Kolkata,2013,46000,Petrol,Manual,First,18.90,998.0,67.10,5.0,wagon
6018,Hyderabad,2011,47000,Diesel,Manual,First,25.44,936.0,57.60,5.0,beat

In [11]:
data.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,creta
2,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,jazz
3,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,ertiga
4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,a4

In [12]:
location = LabelEncoder()

In [13]:
data["Location"] = location.fit_transform(data["Location"])

/home/ritik/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [14]:
data["Fuel_Type"].unique()

array(['CNG', 'Diesel', 'Petrol', 'LPG', 'Electric'], dtype=object)

In [15]:
data.replace({'CNG':0, 'Diesel':1, 'Petrol':2, 'LPG':3, 'Electric':4}, inplace=True)

/home/ritik/.local/lib/python3.6/site-packages/pandas/core/frame.py:4172: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  method=method,

In [16]:
data["Transmission"].unique()

array(['Manual', 'Automatic'], dtype=object)

In [17]:
data.replace({'Manual':0, 'Automatic':1}, inplace=True)

In [18]:
data["Owner_Type"].unique()

array(['First', 'Second', 'Fourth & Above', 'Third'], dtype=object)

In [19]:
data.replace({'First':0, 'Second':1, 'Fourth & Above':3, 'Third':2}, inplace=True)

In [20]:
data.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Model
0,9,2010,72000,0,0,0,26.60,998.0,58.16,5.0,wagon
1,10,2015,41000,1,0,0,19.67,1582.0,126.20,5.0,creta
2,2,2011,46000,2,0,0,18.20,1199.0,88.70,5.0,jazz
3,2,2012,87000,1,0,0,20.77,1248.0,88.76,7.0,ertiga
4,3,2013,40670,1,1,1,15.20,1968.0,140.80,5.0,a4

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Location           6019 non-null   int64
 1   Year               6019 non-null   int64
 2   Kilometers_Driven  6019 non-null   int64
 3   Fuel_Type          6019 non-null   int64
 4   Transmission       6019 non-null   int64
 5   Owner_Type         6019 non-null   int64
 6   Mileage            6019 non-null   float64
 7   Engine             6019 non-null   float64
 8   Power              6019 non-null   float64
 9   Seats              6019 non-null   float64
 10  Model              6019 non-null   object
dtypes: float64(4), int64(6), object(1)
memory usage: 517.4+ KB

In [22]:
model = LabelEncoder()
data["Model"] = model.fit_transform(data["Model"])

/home/ritik/.local/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [23]:
from sklearn.model_selection import train_test_split
data,X_test,y_train,y_test=train_test_split(data,Y,test_size=0.2)

# Label Encoding Our Dataset

In [76]:
columnTransformer = ColumnTransformer([('encoder', 
                                        OneHotEncoder(), 
                                        ["Brand"])], 
                                      remainder='passthrough')

In [77]:
data = np.array(columnTransformer.fit_transform(data))
data

array(<6019x41 sparse matrix of type '<class 'numpy.float64'>'
	with 62648 stored elements in Compressed Sparse Row format>, dtype=object)

In [24]:
from sklearn.linear_model import LinearRegression
regressor=LinearRegression()

In [25]:
regressor.fit(data,y_train)

LinearRegression()

In [28]:
y_pred = regressor.predict(X_test)

In [29]:
from sklearn.metrics import mean_squared_error
mean_squared_error(y_test,y_pred)

38.94495848045897